<a href="https://colab.research.google.com/github/Aline-YG/WoMakersCode-exercicio-SQL/blob/main/Untitled9.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**Exercícios Banco de Dados**

##1. Crie uma tabela chamada "alunos" com os seguintes campos: id(inteiro), nome (texto), idade (inteiro) e curso (texto).

In [ ]:
import sqlite3 #Importando biblioteca para usar o Python junto com o Banco de Dados

conexao = sqlite3.connect('bancoexercicio')
cursor = conexao.cursor()

In [ ]:
cursor.execute('CREATE TABLE alunos (id INT, nome VARCHAR(100), idade INT, curso VARCHAR(100))')

OperationalError: table alunos already exists

##2. Insira pelo menos 5 registros de alunos na tabela que você criou no exercício anterior.

In [ ]:
cursor.execute('INSERT INTO alunos (id, nome, idade, curso) VALUES (1, "Aline", 36, "Ciência de Dados")')
cursor.execute('INSERT INTO alunos (id, nome, idade, curso) VALUES (2, "Ivete", 18, "Contabilidade")')
cursor.execute('INSERT INTO alunos (id, nome, idade, curso) VALUES (3, "Larissa", 22, "Administração")')
cursor.execute('INSERT INTO alunos (id, nome, idade, curso) VALUES (4, "Ana Clara", 16, "Ciência de Dados")')
cursor.execute('INSERT INTO alunos (id, nome, idade, curso) VALUES (5, "Ana Maria", 55, "Culinária")')
cursor.execute('INSERT INTO alunos (id, nome, idade, curso) VALUES (6, "Joy", 40, "Culinária")')

##3. Consultas Básicas. Escreva consultas SQL para realizar as seguintes tarefas:

##a) Selecionar todos os registros da tabela "alunos".

In [ ]:
dados = cursor.execute('SELECT * from alunos')
for alunos in dados:
  print(alunos)

(1, 'Aline', 36, 'Ciência de Dados')
(2, 'Ivete', 18, 'Engenharia')
(4, 'Ana Clara', 16, 'Ciência de Dados')
(5, 'Ana Maria', 55, 'Engenharia')
(6, 'Joy', 36, 'Culinária')

##b) Selecionar o nome e a idade dos alunos com mais de 20 anos.

In [ ]:
dados = cursor.execute('SELECT nome, idade from alunos WHERE idade >20')
for alunos in dados:
  print(alunos)

('Aline', 36)
('Larissa', 22)
('Ana Maria', 55)
('Joy', 40)

##c) Selecionar os alunos do curso de "Engenharia" em ordem alfabética.

In [ ]:
# Alterando o curso de alguns alunos para Engenharia.
cursor.execute('UPDATE alunos SET curso = "Engenharia" WHERE id = 2')
cursor.execute('UPDATE alunos SET curso = "Engenharia" WHERE id = 3')
cursor.execute('UPDATE alunos SET curso = "Engenharia" WHERE id = 5')

In [ ]:
dados = cursor.execute('SELECT * from alunos WHERE curso = "Engenharia" ORDER BY nome')
for alunos in dados:
  print(alunos)

(5, 'Ana Maria', 55, 'Engenharia')
(2, 'Ivete', 18, 'Engenharia')
(3, 'Larissa', 22, 'Engenharia')

##d) Contar o número total de alunos na tabela

In [ ]:
cursor.execute('SELECT COUNT (*) FROM alunos')
total_alunos = cursor.fetchone()[0]
print(f'Total de alunos: {total_alunos}')

Total de alunos: 6

##4. Atualização e Remoção.

##a) Atualize a idade de um aluno específico na tabela.

In [ ]:
#Atualizando a idade do aluno de id 6, de 40 anos para 36 anos.
cursor.execute('UPDATE alunos SET idade = 36 WHERE id = 6')

##b) Remova um aluno pelo seu ID.

In [ ]:
#Deletando a aluna de id 3.
cursor.execute('DELETE FROM alunos where id = 3')

##5. Criar uma Tabela e Inserir Dados. Crie uma tabela chamada "clientes" com os campos: id (chave primária), nome (texto), idade (inteiro) e saldo (float). Insira alguns registros de clientes na tabela.

In [ ]:
cursor.execute('CREATE TABLE clientes (id INT PRIMARY KEY, nome VARCHAR(100), idade INT, saldo DECIMAL(10.0))')

In [ ]:
cursor.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES (1, "Aline", 30, 2000.88)')
cursor.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES (2, "João", 21, 555.90)')
cursor.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES (3, "Maria Lucia", 17, 354.99)')
cursor.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES (4, "Joana", 60, 853.39)')
cursor.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES (5, "Mauro", 44, 25.50)')

In [ ]:
dados = cursor.execute('SELECT * from clientes')
for clientes in dados:
  print(clientes)

(1, 'Aline', 30, 2000.88)
(3, 'Maria Lucia', 17, 354.99)
(4, 'Joana', 60, 853.39)
(5, 'Mauro', 44, 3050.99)

##6. Consultas e Funções Agregadas. Escreva consultas SQL para realizar as seguintes tarefas:

##a) Selecione o nome e a idade dos clientes com idade superior a 30 anos.

In [ ]:
dados_clientes = cursor.execute('SELECT nome, idade from clientes WHERE idade >30')
for clientes in dados_clientes:
  print(clientes)

('Joana', 60)
('Mauro', 44)

##b) Calcule o saldo médio dos clientes.

In [ ]:
cursor.execute('SELECT AVG(saldo) FROM clientes')
saldo_medio = cursor.fetchone()[0]
print(f"Saldo médio dos clientes: {saldo_medio:.2f}.")

Saldo médio dos clientes: 758.13.

##c) Encontre o cliente com o saldo máximo.

In [ ]:
cursor.execute('SELECT nome, saldo FROM clientes ORDER BY saldo DESC LIMIT 1')
cliente_saldo_max = cursor.fetchone()
print(f'Cliente com maior saldo é {cliente_saldo_max[0]}, com o valor de {cliente_saldo_max[1]}.')

Cliente com maior saldo é Aline, com o valor de 2000.88.

##d) Conte quantos clientes têm saldo acima de 1000.

In [ ]:
cursor.execute('SELECT COUNT (*) FROM clientes WHERE saldo>1000')
saldo_maior_1000 = cursor.fetchone()[0]
print(f'Quantidade de clientes com saldo acima de 1000: {saldo_maior_1000}')

Quantidade de clientes com saldo acima de 1000: 1

##7. Atualização e Remoção com Condições:

##a) Atualize o saldo de um cliente específico.

In [ ]:
#Atualizando o saldo do cliente de id 5 de 25.50 para 3050.99.
cursor.execute('UPDATE clientes SET saldo = 3050.99 WHERE id = 5')

##b) Remova um cliente pelo seu ID.

In [ ]:
#Deletando o cliente de id 2.
cursor.execute('DELETE FROM clientes where id = 2')

##8. Junção de Tabelas. Crie uma segunda tabela chamada "compras" com os campos: id (chave primária), cliente_id (chave estrangeira referenciando o id da tabela "clientes"), produto (texto) e valor (real). Insira algumas compras associadas a clientes existentes na tabela "clientes". Escreva uma consulta para exibir o nome do cliente, o produto e o valor de cada compra.

In [ ]:
#Criação da tabela compras
cursor.execute('CREATE TABLE compras (id INT PRIMARY KEY, cliente_id INT , produto VARCHAR(80), valor REAL, FOREIGN KEY(cliente_id) REFERENCES clientes(id))')

In [ ]:
#Inserção de dados na tabela compras
cursor.execute('INSERT INTO compras (id, cliente_id, produto, valor) VALUES (1, 1, "camisa", 399.90)')
cursor.execute('INSERT INTO compras (id, cliente_id, produto, valor) VALUES (2, 3, "calça sarja", 250.00)')
cursor.execute('INSERT INTO compras (id, cliente_id, produto, valor) VALUES (3, 5, "jaqueta denim", 790.99)')

In [ ]:
# Conferindo a inserção
dados_compras = cursor.execute('SELECT * from compras')
for compras in dados_compras:
  print(compras)

(1, 1, 'camisa', 399.9)
(2, 3, 'calça sarja', 250.0)
(3, 5, 'jaqueta denim', 790.99)

In [ ]:
#Select com duas tabelas
dados_compras_clientes = cursor.execute('Select nome, produto, valor from compras LEFT JOIN clientes ON compras.cliente_id = clientes.id')
for compras in dados_compras_clientes:
    print(compras)

('Aline', 'camisa', 399.9)
('Maria Lucia', 'calça sarja', 250.0)
('Mauro', 'jaqueta denim', 790.99)

In [ ]:
#Commitando e fechando
conexao.commit()
conexao.close